/*
Задача 4:
Ако E е списък от списъци с дължина 2, да означим с G(E) ориентирания граф, 
в който няма изолирани върхове и от върха u към върха v има ребро 
точно тогава, когато [u, v] е елемент на списъка E. 

Да се дефинира на Prolog предикат p(E, v), който по даден списък от 
двуелементни списъци E и връх v на графа G(E) проверява дали в G(E) 
има цикъл, преминаващ през v.
*/

% Идеята на задачата, е да се провери дали има път от V -> U и после от някакво U -> V, понеже графът е ориентиран

member(X, [X | _]).
member(X, [H | L]) :- member(X, L), X =\ H.

% Проверяваме дали има път от V -> U и ще проверим дали има път от U -> V. 
p(E,V) :- member([V,U], E), path(E, U, V, [V]).

% Накрая ако съществъва такъв път Current(U) -> Target(V) сме доказали задачата
path(E, Current, Target, _) :- member([Current, Target], E).

% Проверяваме дали съществъва път от Current връх към Next върха и е мнного важно Next да не е бил посетен
% След това проверяваме дали има път oт Next -> Таrget(V) като Current се добавя във Visited 
path(E, Current, Target, Visited) :-
    member([Current, Next], E),
    not(member(Next, Visited)),
    path(E, Next, Target, [Current | Visited]).