/*
  Задача 4: Казваме, че списъкът X от естествени числа е:
  кентракуляр за списъка от списъци от естествени числа Y,
  ако всеки елемент на Y съдържа елемент, който дели без остатък някой
  елемент на X, а всеки елемент на X дели без остатък някой елемент на
  елемент на Y.
*/

% X е списък от естествени числа
% Y е списък от списъци от естествени числа

% Условие 1: ако всеки елемент на Y съдържа елемент, който дели без остатък някой елемент на X
% Условие 2: Ако всеки елемент на X дели без остатък някой елемент на елемент на Y

% Тук е дефинирано условие 2
canDivideElementInList(H, Z) :- member(N, Z), N mod H =:= 0.
condition2([], _).
condition2([H | T], Y) :- member(Z, Y), canDivideElementInList(H, Z), condition2(T, Y).

% Тук е дефинирано условие 1
condition1(X, []).
condition1(X, [H | T]) :- member(N, H), canDivideElementInList(N, X), condition1(X, T).

kentekular(X,Y) :- condition1(X, Y), condition2(X,Y).