/*
  Зад. 8. Нека G = (V, E) е неориентиран граф. За два върха u, v ∈ V на G 
  казваме, че u е съсед на v, ако {u, v} ∈ E е ребро на G. Ще наричаме 
  графа G "k-наситен", ако за всеки връх v ∈ V множеството от съседите 
  на v има поне k елемента. 
  
  Представяне на G наричаме такъв списък Edges от двуелементни списъци, 
  че за всяко ребро {u, v} ∈ E на G поне един от списъците [u, v] и [v, u] 
  е елемент на Edges и за всеки елемент [u, v] на Edges реброто {u, v} е от E.
  
  Да се дефинира на Пролог двуместен предикат ps_Gr(Edges, K), който по 
  дадено представяне Edges на неориентиран граф G без изолирани върхове 
  и естествено число K > 1 разпознава дали G е K-наситен.
*/
member(X, [X | _ ]).
member(X, [H | T]) :- member(X, T), X \= H.

% Достатъчно условие X да е връх, ако има такъв ръб R, който да съдържа X
node(E, X) :- member(R, E), member(X, R).

% Ако нямаме ръбове и самото число накрая ще бъде 0
calcNeigbours([], _, _, 0).

% Минаваме през всички ръбове, ако нашият търсен ръб U е свързан към някое V 
% и това V не е посетено, тогава вдигаме броя на съседите с 1ца
calcNeigbours([ [U,V] | Edges], U, Visited, N) :-
    not(member(V, Visited)),
    count_Neighbours(Edges, U, [V | Visited], M),
    N is M+1.

% Минаваме през всички ръбове, ако нашият търсен ръб U е свързан към някое V 
% и това V не е посетено, тогава вдигаме броя на съседите с 1ца
calcNeigbours([ [V,U] | Edges], U, Visited, N) :-
    not(member(V, Visited)),
    count_Neighbours(Edges, U, [V | Visited], M),
    N is M+1.

% Минаваме през всички ръбове, ако нашият търсен ръб U е свързан към някое V, но
% това V е посетено, тогава не вдигаме броят на съседите с 1ца и продължаваме напред
calcNeigbours([ [V,U] | Edges], U, Visited, N) :-
    member(V, Visited),
    count_Neighbours(Edges, U, Visited, N).

% Минаваме през всички ръбове, ако нашият търсен ръб U е свързан към някое V, но
% това V е посетено, тогава не вдигаме броят на съседите с 1ца и продължаваме напред
calcNeigbours([ [U,V] | Edges], U, Visited, N) :-
    member(V, Visited),
    count_Neighbours(Edges, U, Visited, N).

% Ако имаме върхове, който са различи от нашият търсен U, тогава продължаваме напред
calcNeigbours( [[X1,X2] | Edges], U, Visited, N) :-
    X1 \= U,
    X2 \= U,
    count_Neighbours(Edges, U, Vis, N).

% Няма такъв връх N, където неговите съсъди да са по-малко от К
ps_Gr(Edges, K) :- not((node(Edges, N), calcNeigbours(Edges, N, [], M), M < K)).