% Зад. 10. Казваме, че списък от списъци L е ламинарен, ако
% всеки два списъка от L или нямат общи елементи, или всички
% елементи на единия са елементи на другия.
% Да се дефинира на пролог предикат is_laminar(L), който по да-
% ден списък от списъци L проверява дали L е ламинарен.

% Тоест няма два елемента, който да имат общо елементи в L
% Всички елементи са елементи на другия

member(X, [X | _]).
member(X, [H | T]) :- member(X, T), X \= H.

% няма такъв елемент, който едновременно да се намира в L1 и L2 
noneCommonElements(L1,L2) :- not((member(A, L1), member(A, L2))).

subset([],_).
subset([H | L1], L2) :- member(H, L2), subset(L1,L2).

% Няма такива елементи A и B в L, за който да не е вярно че имат общи елементи
isLaminar(L) :- not((member(A,L), member(B,L), A \= B, not(noneCommonElements(A,B)))).

% Няма такива елементи A и В в L, че те елементите на единия да са елменти на другия
isLaminar(L) :- not((member(A,L), member(B,L), A \= B, subset(A,B))).

