% =============================================================================
% Задача 9:
% Ще казвам, че списък от естествени числа е:
%
% 1. квадратичен, ако както дължината му, така и сумата на елементите му
%    са квадрати за естествени числа.
% 
% 2. кубичен, ако както дължината му, така и сумата на елементите му са
%    точни трети степени на естествени числа.
% 
% Да се дефинира предикат на пролог:
% 
% 1. squareList(L), който проверява дали списък от естествени числа L е 
%    квадратичен.
% 
% 2. cubeList(L), който проверява дали списък от естествени числа L е кубичен.
% =============================================================================
len([],0).
len([H | T], N) :- len(T,M), N is M+1.

sum([X], X).
sum([H | T], N) :- sum(T, M), N is M+H.

nat(0).
nat(X) :- nat(Y), X is Y+1.

% Проверява дали числото N е корен квадратен на някое естествено число
isSquare(N) :- nat(M), N is M^2.

% Проверява дали числото N е кубичен на дадено естествено число 
isCube(N) :- nat(M), M2 is M*M, N is M2*M.

% Взима се дължината N на списъка L, проверява се дали е isSquare и се прави същото за S
squareList(L) :- len(L,N), isSquare(N), sum(L, S), isSquare(S).

% Взима се дължината N на списъка L, проверява се дали е isCube и се прави същото за S
cubeList(L) :- len(L,N), isCube(N), sum(L, S), isCube(S).
