/*
  Задача 3: Казваме, че списъкът X от естествени числа е
  контракуляр за списъка от списъци от естествени числа Y,
  ако всеки елемент на Y съдържа елемент, който се дели без остатък от
  всички елементи на X, а всеки елемент на X се дели без остатък от някой
  елемент на елемент на Y.
*/

% Y е списък от списъци
% X е списък от числа 

% Ако всеки елемент на Y съдържа елемент, който се дели без остатък на всички елементи на X
% Ако всеки елемент на X се дели без остатък от някой елемент на елемент на Y
member(X, [X | _]).
member(X, [H | L]) :- member(X, L), X \= H.

% тук за всеки един елемент на X се проверява дали дели Z без остатък
allMembersDivideElement_helper([], _).
allMembersDivideElement_helper([H | T], Z) :- Z mod H =:= 0, allMembersDivideElement_helper(T, Z).

% Тук се съдържа един елемент от елемент на Y, който да бъде делене правилно от елементите на X
allMembersDivideElement(X, L) :- member(Z, L), allMembersDivideElement_helper(X, L).

% Ако всеки един елемент на Y ([H | T]) съдържа елемент(H), който се дели на без остатък на всички елементи на X
% Тоест дава се всеки елемент на Y (който е възможно да бъде лист) да се провери дали има елемнт който се дели от всички на X
conditionOne(X, []).
conditionOne(X, [H | T]) :- allMembersDivideElement(X, H), conditionOne(X, T).

% Ако той е лист, тогава трябва да има само един елемент от него Y, че той да дели X 
hasAtLeastOneDiv(X, L) :- member(Y, L), X mod Y =:= 0.

% Ако всеки един елемент на X ([H | Y]) се дели без остатък на няко елемент от Y
% Взима се един елемент от Y (Z), такъв че той може да раздели H 
conditionTwo([], _).
conditionTwo([H | T], Y) :- member(Z, Y), hasAtLeastOneDiv(H, Z), conditionTwo(T, Y).

contra(X, Y) :- conditionOne(X, Y), conditionTwo(X, Y).