% Зад 1: Дължина на списък L 
len([], 0).
len([_ | L], X) :- len(L, Y), X is Y + 1.
% Главата на списъка L не се гледа, а списъка се предава напред като Y е X - 1, за да може да стигнем до празен списък [].

% Зад 2: Сума от елементите на списък L 
sum([X], X).
sum([H | L], Sum) :- sum(L, LSum), Sum is LSum + H.
% Взима главата H на списъка L и извиква предава остатъка от списък L заедно с сумата на остака от списъка L, тогава финалната сума е H + SumL

% Зад 3: Да се вземе n-тия елемент X от списъка L
nthElement(X, 0, [X | _]).
nthElement(X, N , [_ | L]) :- nthElement(X, Y, L), N is Y + 1.
% X е елемента, който трябва да вземем, а N е индекса на елемента в листа L, предаваме списъка нататък като N се намалява с 1 чрез Y, накрая когато N = 0, главата се взима от останалият списък и се присвоява на X.

% Зад 4: Дефиниране на естествено число в Пролог
natural(0).
natural(X) :- natural(Y), X is Y+1.

% Зад 5: Да се направи проверка дали числото X е четно/нечетно
even(X) :- natural(X), X mod 2 =:= 0.
odd(X) :- natural(X), X mod 2 =!= 0.

% Зад 6: Дефиниране на цяло число 
member(X, [X | _]).
member(X, [H | L]) :- member(X, L), X \= H.

int(0).
int(X) :- natural(Y), Y > 0, member(Z, [1, -1]), X is Y * Z.
% За да може X да е цяло число, взимаме естествено число Y и то е умножено по избран на случаен принцип Z, което е -1 или 1, 

% Зад 7: Да се създаде предикат between, който запазва в X едно по едно всички числа в [A,B]
between(A,B,A) :- A =< B.
between(A,B,X) :- A < B, A1 is A+1, between(A1,B,X).
% Връща всички числа от интервала [A,B] едно по едно като го запазва в X, тоест не ти го връща всички на масив а едно по едно

% Зад 8: Да се генерира лист L, който да съдържа числата между [A,B]
range(A,B, []) :- A > B.
range(A,B, [A | L]) :- A =< B, A1 is A+1, range(A1,B,L).
% Връща цялостно всички числа, който се намират между A и B в един списък L 

% Зад 9: Да се генерира двойка естествени числа <X,Y>
pairNatural(X,Y) :- natural(Z), between(0,Z,X), Y is Z - X. 


% Зад 10: Да се генерират всички списъци L, който имат N елемента и сумата между елементите е S 
genNS(0,0,[]).
genNS(N,S, [H | L]) :-
    N > 0,
    between(0,S,H),
    S1 is S - H,
    N1 is N - 1,
    genNS(N1, S1, L).
% N е броят на елементите в L, а S e тяхната сума
% Взима се едно число H, което се добавя към списъка и другите числа добавени трябват да имат сумата S - H
% Така след това се намаля и стойноста на N, за да може елементите на брой N - 1 да имат сума от S - H 