% Зад 1: Проверка дали елемента X е първият в листа L
first(X, [X]).
first(X, [X | L]).

% Зад 2: Проверка дали елемента X е вторият в листа L
second(X, [H, X | L]).

% Зад 3: Проверка дали X е последния елемент в листа L
last([],[]).
last(X, [X]).
last(X, [ H | L]) :- last(X, L).
% Проверява дали главата H на L e равна на X, ако не е предава листа напред, чак когато L1 има един единствен елемент, който е равен на X ще върне true

% Зад 4: Проверява дали X е част от L
member(X, [X | _ ]).
member(X, [ H | L]) :- member(X,L).
% Ако X е различен от главата H на L1, тогава предаваме листа нататък, а когато X е равна на главата на L1 имаме true като върнат резултат
 

% Зад 5: Append-ване на L1 и L2, в по-голям списък L3
append([], L2, L2).
append([H | L1], L2, [H | Result]) :- append(L1, L2, Result).
% Доваяне главата H на L1 към L3 и предаваме нататък списъците, но когато стигнем края на L1 предаваме целият L2 списък към L3.


% Зад 6: Премахване на първото срещане на X в L1, резултата е записан в L2
remove(X, [X | L1], L1).
remove(X, [H | L1], [H | L2]) :- remove(X, L1, L2).
% Добавяме главата H от списък L1 в списък L2, ако е H != X и предаваме напред, но когато е главата е равна на X, пропускаме добавянето на L2 и предаваме L1 и L2 нататък.
% Когато стигнем до края на L1 предаваме към L2 един празен списък

% Зад 7: Добавяне на елемент X в списък L, така за да получим списък R 
insert(X,L1,L2) :- remove(X, L2, L1).
% Това е гениално, защото ако добавим X в L и получим R, това ще е абсолютно същия списък от това да изкараме X от R, за да получим L

