/*
  Задача 11:
  Да се дефинира на Пролог предикат p(X, Y), който по даден списък от числа X,
  при преудовлетворяване (backtracking), дава в Y всички секции на X.
  
  Дефиниция на "секция":
  Ако X = [a1, a2, ..., an], то Y е секция [a_i1, a_i2, ..., a_ik], където:
    1) 1 <= i1 < i2 < ... < ik <= n  (индексите са в растящ ред - запазва се редът от X)
    2) a_i1 <= a_i2 <= ... <= a_ik  (самите елементи са в ненамаляващ ред)

  Пример:
  ?- p([3, 1, 4, 2], Y).
  Възможни отговори за Y:
  [], [3], [3, 4], [1], [1, 4], [1, 2], [4], [2] ... (всички такива подпоследователности)
*/

% Взима се подмножество от [H | R], индексите на елементите в [H | L] са сортирани,
% Пример subset([3,6,8], [3,2,6,7,8,9]) ще върне true защото позицията на 3,6,8 е непроменена и самите елементи са сортирани
subset([], _).
subset([H | L], [Q | R]) :- subset([H | L], R), H \= Q.
subset([H | L], [H | R]) :- subset(L , R).

lessOrEqual(X, Y) :- X =< Y.

isSorted([]).
isSorted([X]).
isSorted([X,Y | H]) :- lessOrEqual(X,Y), isSorted([Y | H]).

% Една секция трябва да е сортирани и с правилни индекси 
p(X, Y) :- subset(Y,X), isSorted(Y).