/*
  Задача 12:
  Да се дефинират на пролог предикати p1(X), p2(X), p3(X), p4(X), такива че ако X е списък от списъци, то:
- p1(X) => празният списък е елемент на X
- p2(X) => X съдържат елементи Y и Z, които нямат общи елементи
- p3(X) => X съдържа елемент Y, чиито елементи са елементите на всички елементи на X
- p4(X) => За всеки елемент Y на X съществува елемент Z на X, такъв че Y и Z нямат общи елементи
*/
member(X, [X | _]).
member(X, [H | T]) :- member(X, T), X \= H.

p1(X) :- member([], X).

% За елемент Y от X и елемент Z от X, такива че няма елемент N от Y, който да се съдържа в Z 
p2(X) :- member(Y, X), member(Z, X), not((member(N, Y), member(N,Z))).

% Проверка дали даден лист е част от друг лист (L), това се случва ако всеки един елемент е member на L.
subset([], _).
subset([H | T], L) :- member(H, L), subset(T, L).

% Търсим такъв списък Y от X, такъв че е част (демек подмножество) на всеки един друг лист от X ([H | T])
p3_helper(_, []).
p3_helper(Y, [H | T]) :- subset(Y, H), p3_helper(Y, T).
p3(X) :- member(Y, X), p3_helper(Y, X).
