/*
Задача 6:
Да се дефинира на Prolog предикат p(L), който по даден списък от списъци L 
разпознава дали L може да се сортира по отношение на строго включване (⊂).

Дефиниция:
Ако l1 и l2 са списъци, l1 ⊂ l2 означава, че всички елементи на l1 са 
елементи на l2, но не всички елементи на l2 са елементи на l1.

Примери и тестове:
- p([[1], [1, 2], [1, 2, 3]]) -> true (вече е сортиран)
- p([[1, 2, 3], [1]]) -> true (може да се сортира до [[1], [1, 2, 3]])
- p([[0], [1]]) -> false (нито един не е подмножество на другия)
*/

member(X, [X | _]).
member(X, [H | L1]) :- member(X, L1), X \= H.

% Проверява дали елементите от L1 се намират в L2, това подмога за търсената в задачата релация
isSubset([], _).
isSubset([H | L1], L2) :- member(H, L2), isSubset(L1, L2).

% Премахва елемента X от лист и създава нов лист без него, нужен ни е този предикат за insert
remove(X, [], _).
remove(X, [X | T], Q) :- remove(X, T, Q).
remove(X, [H | T], [H | Q]) :- remove(X, T, Q), X \= H.

% Добавя X към L и така да получим R, но това се постига като премахнем X от R за да получим L
insert(X, L, R) :- remove(X, R, L).

% Създаване на пермутация, този предикат ни помага, ако искаме даден списък да го поразбъркаме вътре
permutation([], []).
permutation([H | T], P) :- permutation(T, TP), insert(H, TP, P).

relation(L1, L2) :- isSubset(L1, L2), not(isSubset(L2, L1)).

isSorted([]).
isSorted([X]).
isSorted([X,Y | L]) :- relation(X,Y), isSorted([Y | L]).

% Понеже условието в задачате ни се иска да проверим дали L може да се сортира
% Напълнои възможно е да имаме случайна пермутация на L и тя да бъде сортирана 
p(L) :- permutation(L, LP), isSorted(LP).

