/*
ЗАДАЧА 7 
Нека L е списък от списъци, L = [l1, l2, ..., ln]. 
Казваме, че двойката от списъци F, G е разбиване на L, ако:
  - F = [li1, li2, ..., lik]
  - G = [lj1, lj2, ..., ljn-k]
  - {i1, i2, ..., ik, j1, j2, ..., jn-k} = {1, 2, ..., n}

Обединение на списък от списъци е множеството на всички обекти, 
които са елементи на някой елемент на списъка.

УСЛОВИЕ:
Да се дефинира на Пролог едноместен предикат p(L), който по даден 
списък от списъци L разпознава дали L може да се разбие на два 
списъка, които имат едно и също обединение.
*/

append([], L, L).
append([H | T], L, [H | R]) :- append(T, L, R).

% Разделяме елементите на един списък, един елемент може да отиде ту в единия ту в другия
partition([], [], []).
partition([H|T], [H|F], G) :- partition(T, F, G).
partition([H|T], F, [H|G]) :- partition(T, F, G).

% Проверка дали даден елемент се намира в листа
member(X, [X | _]).
member(X, [H | T]) :- member(X, T), X \= H.

% Проверява дали всичките елементи на даден лист са част от L
allElemMembers([], _).
allElemMembers([H | R], L) :- member(H, L), allElemMembers(R,L).

% Разделя списъка L на две части L1, L2, след това ги добавя заедно в R и проверява дали всички елементи на R са в L.
p(L) :- partition(L, L1, L2), append(L1,L2, R), allElemMembers(R, L).

