/*
ЗАДАЧА 1:
Да се дефинира на Пролог двуместен предикат с аргументи X и Y, който по даден
списък X от списъци генерира при преудовлетворяване в Y елементите на 
декартовото произведение на елементите на X. 

Например, ако X е [L1, L2, L3, L4], елементите на декартовото произведение на
елементите на X са списъците от вида [a1, a2, a3, a4], където за всяко i, 
1 <= i <= 4, ai е елемент на Li.
*/

% Разбирай да се генерират всичкии списъци Y, който да съдържат елементи a1,a2,a3 като ai е част от Li
% Демек от всеки лист да се вземе по един елемент 

member(X, [X | _]).
member(X, [H | T]) :- member(X, T), X \= H.

decart([], []).
decart([H | X], [Elem | Y]) :- member(Elem, H), decart(X, Y).
% Взимаме първият лист H от X, след това избираме рандом елемент от него Elem и той е добавен към Y 
% След това предаваме списъците нататък и така успяваме да генерираме всичките такива списъци Y 