/*
Задача 9:
Да се дефинира на Пролог думестен предикатен символ p, който по даден списък от списъци L генерира в M
най-дългата обща подредица на елементите на L.
*/
subsequence([], _).
subsequence([H | T], [R | Q]) :- subsequence([H | T], Q), H \= R.
subsequence([H | T], [H | Q]) :- subsequence(T, Q).

len([], 0).
len([_ | T], N) :- len(T, N1), N is N1+1.

% Съществува такава подредица M с дължина P, и не съществува такава редица N от L, която да има дължина K и да е по-голяма от дължината P
p(L, M) :- subsequence(M, L),len(M, P), not((subsequence(N, L), len(N,K), K > P)).